{"-s2-mix-blend-mode":{"description":"Controls blending mode for the panel.  See CSS mix-blend-mode docs on web, except normal for us is with alpha blending.","example":"-s2-mix-blend-mode: normal;\r\n-s2-mix-blend-mode: multiply;\r\n-s2-mix-blend-mode: screen;"},"align":{"description":"&lt;Needs a description&gt;"},"animation":{"description":"&lt;Needs a description&gt;"},"animation-delay":{"description":"&lt;Needs a description&gt;"},"animation-direction":{"description":"&lt;Needs a description&gt;"},"animation-duration":{"description":"&lt;Needs a description&gt;"},"animation-fill-mode":{"description":"&lt;Needs a description&gt;"},"animation-iteration-count":{"description":"&lt;Needs a description&gt;"},"animation-name":{"description":"&lt;Needs a description&gt;"},"animation-timing-function":{"description":"&lt;Needs a description&gt;"},"background-blur":{"description":"Sets the amount of blur to apply to the contents behind this panel during composition.  Default is no blur, for now Gaussian is the only blur type and takes a horizontal standard deviation, vertical standard deviation, and number of passes.  Good std deviation values are around 0-10, if 10 is still not intense enough consider more passes, but more than one pass is bad for perf.  As shorthand you can specify with just one value, which will be used for the standard deviation in both directions and 1 pass will be set.","example":"background-blur: gaussian( 2.5 );\r\nbackground-blur: gaussian( 6, 6, 1 );"},"background-color":{"description":"Sets the background fill color/gradient/combination for a panel.","example":"background-color: #FFFFFFFF;\r\nbackground-color: gradient( linear, 0% 0%, 0% 100%, from( #fbfbfbff ), to( #c0c0c0c0 ) );\r\nbackground-color: gradient( linear, 0% 0%, 0% 100%, from( #fbfbfbff ), color-stop( 0.3, #ebebebff ), to( #c0c0c0c0 ) );\r\nbackground-color: gradient( radial, 50% 50%, 0% 0%, 80% 80%, from( #00ff00ff ), to( #0000ffff ) );\r\nbackground-color: #0d1c22ff, gradient( radial, 100% -0%, 100px -40px, 320% 270%, from( #3a464bff ), color-stop( 0.23, #0d1c22ff ), to( #0d1c22ff ) );"},"background-color-opacity":{"description":"Sets the background color opacity for a panel (does nothing on its own, but when merged with a full background-color it overrides the opacity).","example":"background-color-opacity: 0.5;"},"background-image":{"description":"Comma separated list of images or movies to draw in the background. Can specify \"none\" to not draw a background layer. Combined with background-position, background-size and background-repeat values.","example":"background-image: url(\"file://{images}/default.tga\"), url( \"file://{movies}/Background1080p.webm\" );"},"background-position":{"description":"Controls the horizontal and vertical placement of the background image, with the format: &lt;left|center|right&gt; &lt;horizontal length&gt; &lt;top|center|bottom&gt; &lt;vertical length&gt;\r\nIf length is a percent, the specified location within the image is positioned over that same specified position in the background. If the length is pixels, the top left corner is placed relative to the provided alignment keywords (left, bottom, etc.). See examples for more details.\r\n\r\nIf 1 value is specified, the other value is assumed to be center. If 2 values are specified, the first value must be for horizontal placement and the second for vertical.","example":"// aligns the top left corner of the image with the top left corner of the panel (default)\r\nbackground-position: 0% 0%;\r\n// centers the image within the background (same as \"center center\")\r\nbackground-position: center;\r\n\r\n// aligns the bottom right corner of the image with the bottom right corner of the panel (same as \"100% 100%\")\r\nbackground-position: right bottom;\r\n\r\n// the top left corner of the image is placed 10px to the right of, 40px below the top left corner of the panel\r\nbackground-position: left 10px top 40px;"},"background-repeat":{"description":"Controls if the background should be repeated in the horizontal and vertical directions.\r\nPossible values per direction:\r\n\"repeat\" - (default) Repeated in the specified direction until it fills the panel\r\n\"space\" - Repeated as many times as required to fill the panel w/o being clipped. Space is added between images to to align first and last image with panel edges.\r\n\"round\" - Repeated as many times as required to fill the panel w/o being clipped. The image is resized to align first and last image with panel edges.\r\n\"no-repeat\" - Not repeated\r\n\r\nPossible single values:\r\n\"repeat-x\" - equals \"repeat no-repeat\"\r\n\"repeat-y\" - equals \"no-repeat repeat\"","example":"background-repeat: repeat; // equals \"repeat repeat\" (default)\r\nbackground-repeat: repeat space; // repeats horizontally, spaces vertically \r\nbackground-repeat: no-repeat round; // 1 column of images, scaled to fit evenly"},"background-size":{"description":"Sets the horizontal and vertical dimensions used to draw the background image. Can be set in pixels, percent, \"contains\" to size down to panel dimensions or \"auto\" preserves the image aspect ratio. By default, set to \"auto\" which preveres the image's original size.\r\nMultiple background layers can be specified in a comma separated list, which are then combined with background-image, background-position, and background-repeat values.","example":"background-size: auto; // same as \"auto auto\" (default) \r\nbackground-size: 100% 100%; // image fills the panel\r\nbackground-size: 50% 75%; // image fills 50% of the panel's width, and 75% of the panel's height\r\nbackground-size: 300px 200px; // image is drawn 300px wide, 200px tall"},"blur":{"description":"Sets the amount of blur to apply to the panel and all it's children during composition.  Default is no blur, for now Gaussian is the only blur type and takes a horizontal standard deviation, vertical standard deviation, and number of passes.  Good std deviation values are around 0-10, if 10 is still not intense enough consider more passes, but more than one pass is bad for perf.  As shorthand you can specify with just one value, which will be used for the standard deviation in both directions and 1 pass will be set.","example":"blur: gaussian( 2.5 );\r\nblur: gaussian( 6, 6, 1 );"},"border":{"description":"Shorthand for setting panel border. Specify width, style, and color.  Supported styles are: solid, none.","example":"border: 2px solid #111111FF;"},"border-bottom":{"description":"Shorthand for setting the bottom panel border. Specify width, style, and color.  Supported styles are: solid, none.","example":"border-bottom: 2px solid #111111FF;"},"border-bottom-color":{"description":"Specifies border color for the bottom edge of the panel.","example":"border-bottom-color: #111111FF;"},"border-bottom-left-radius":{"description":"Specifies border-radius for bottom-left corner which rounds off border and clips background/foreground content to rounded edge.  Takes 1 or 2 values in px or %, first value is horizontal radii for elliptical corner, second is vertical radii, if only one is specified then horizontal/vertical will both be set and corner will be circular.","example":"border-bottom-left-radius: 2px 2px;\r\nborder-bottom-left-radius: 5%;"},"border-bottom-right-radius":{"description":"Specifies border-radius for bottom-right corner which rounds off border and clips background/foreground content to rounded edge.  Takes 1 or 2 values in px or %, first value is horizontal radii for elliptical corner, second is vertical radii, if only one is specified then horizontal/vertical will both be set and corner will be circular.","example":"border-bottom-right-radius: 2px 2px;\r\nborder-bottom-right-radius: 5%;"},"border-bottom-style":{"description":"Specifies border style for the bottom edge of the panel.","example":"border-bottom-style: solid;"},"border-bottom-width":{"description":"Specifies border width for the bottom edge of the panel.","example":"border-bottom-width: 2px;"},"border-brush":{"description":"EXPERIMENTAL: Sets a more-complex brush for the entire border paint area (ignores normal border color).","example":"border-brush: gradient( linear, 0% 0%, 0% 100%, from( #fbfbfbff ), to( #c0c0c0c0 ) );\r\nborder-brush: gradient( linear, 0% 0%, 0% 100%, from( #fbfbfbff ), color-stop( 0.3, #ebebebff ), to( #c0c0c0c0 ) );\r\nborder-brush: gradient( radial, 50% 50%, 0% 0%, 80% 80%, from( #00ff00ff ), to( #0000ffff ) );"},"border-color":{"description":"Specifies border color for panel.  If a single color value is set it applies to all sides, if 2 are set the first is top/bottom and the second is left/right, if all four are set then they are top, right, bottom, left in order.","example":"border-color: #111111FF;\r\nborder-color: #FF0000FF #00FF00FF #0000FFFF #00FFFFFF;"},"border-left":{"description":"Shorthand for setting the left panel border. Specify width, style, and color.  Supported styles are: solid, none.","example":"border-left: 2px solid #111111FF;"},"border-left-color":{"description":"Specifies border color for the left edge of the panel.","example":"border-left-color: #111111FF;"},"border-left-style":{"description":"Specifies border style for the left edge of the panel.","example":"border-left-style: solid;"},"border-left-width":{"description":"Specifies border width for the left edge of the panel.","example":"border-left-width: 2px;"},"border-radius":{"description":"Shorthand to set border radius for all corners at once.  Border radius rounds off corners of the panel, adjusting the border to smoothly round and also clipping background image/color and contents to the specified elliptical or circular values.  In this shorthand version you may specify a single value for all raddi, or horizontal / vertical separated by the '/' character.  For both horizontal and vertical you may specify 1 to 4 values in pixels or %, they will be taken in order as top-left, top-right, bottom-right, bottom-left radii values.","example":"// 2 px circular corners on all sides\r\nborder-radius: 2px;\r\n// Perfect circular or elliptical panel (circular if box was square)\r\nborder-radius: 50% / 50%;\r\n// 2 px horizontal radii 4px vertical elliptical corners on all sides\r\nborder-radius: 2px / 4px;\r\n// All corners fully specified \r\nborder-radius: 2px 3px 4px 2px / 2px 3px 3px 2px;"},"border-right":{"description":"Shorthand for setting the right panel border. Specify width, style, and color.  Supported styles are: solid, none.","example":"border-right: 2px solid #111111FF;"},"border-right-color":{"description":"Specifies border color for the right edge of the panel.","example":"border-right-color: #111111FF;"},"border-right-style":{"description":"Specifies border style for the right edge of the panel.","example":"border-right-style: solid;"},"border-right-width":{"description":"Specifies border width for the right edge of the panel.","example":"border-right-width: 2px;"},"border-style":{"description":"Specifies border style for panel.  If a single style value is set it applies to all sides, if 2 are set the first is top/bottom and the second is left/right, if all four are set then they are top, right, bottom, left in order.","example":"border-style: solid;\r\nborder-style: solid none solid none;"},"border-top":{"description":"Shorthand for setting the top panel border. Specify width, style, and color.  Supported styles are: solid, none.","example":"border-top: 2px solid #111111FF;"},"border-top-color":{"description":"Specifies border color for the top edge of the panel.","example":"border-top-color: #111111FF;"},"border-top-left-radius":{"description":"Specifies border-radius for top-left corner which rounds off border and clips background/foreground content to rounded edge.  Takes 1 or 2 values in px or %, first value is horizontal radii for elliptical corner, second is vertical radii, if only one is specified then horizontal/vertical will both be set and corner will be circular.","example":"border-top-left-radius: 2px 2px;\r\nborder-top-left-radius: 5%;"},"border-top-right-radius":{"description":"Specifies border-radius for top-right corner which rounds off border and clips background/foreground content to rounded edge.  Takes 1 or 2 values in px or %, first value is horizontal radii for elliptical corner, second is vertical radii, if only one is specified then horizontal/vertical will both be set and corner will be circular.","example":"border-top-right-radius: 2px 2px;\r\nborder-top-right-radius: 5%;"},"border-top-style":{"description":"Specifies border style for the top edge of the panel.","example":"border-top-style: solid;"},"border-top-width":{"description":"Specifies border width for the top edge of the panel.","example":"border-top-width: 2px;"},"border-width":{"description":"Specifies border width for panel.  If a single width value is set it applies to all sides, if 2 are set the first is top/bottom and the second is left/right, if all four are set then they are top, right, bottom, left in order.","example":"border-width: 1px;'\r\nborder-width: 20px 1px 20px 1px;"},"box-shadow":{"description":"Specifies outer shadows for boxes, or inset shadows/glows.  The shadow shape will match the border box for the panel,so use border-radius to affect rounding.  Syntax takes optional 'inset', optional 'fill' then color, and then horizontal offset pixels, vertical offset pixels, blur radius pixels, and spread distance in pixels. Inset means the shadow is an inner shadow/glow, fill is valid only on outer shadows and means draw the shadow behind the entire box, not clipping it to outside the border area only. A negative blur radius will give a hard-edged look to the shadow, effectively a rounded outline of the same size as the blur.","example":"box-shadow: #ffffff80 4px 4px 8px 0px; // outer\r\nbox-shadow: fill #ffffff80 4px 4px 8px 0px; // outer, filled\r\nbox-shadow: inset #333333b0 0px 0px 8px 12px; // inner"},"brightness":{"description":"Sets the brightness that applies to the panel and all it's children during composition. The value is a multiplier on the HSB brightness value.","example":"brightness: 1.5;"},"clip":{"description":"Specifies a clip region within the panel, where contents will be clipped at render time. This clipping has no impact on layout, and is fast and supported for transitions/animations. Radial clip mode takes a center point, start angle and angular width of the revealed sector.","example":"clip: rect( 10%, 90%, 90%, 10% );clip: radial( 50% %50, 0deg, 90deg );"},"color":{"description":"Sets the foreground fill color/gradient/combination for a panel.  This color is the color used to render text within the panel.","example":"color: #FFFFFFFF;\r\ncolor: gradient( linear, 0% 0%, 0% 100%, from( #cbcbcbff ), to( #a0a0a0a0 ) );"},"context-menu-arrow-position":{"description":"Specifies where to point the arrow of a context menu at on this panel. The first value controls how the arrow is positioned horizontally when the context menu is to the top or bottom of the panel, and the second value controls how the arrow is positioned vertically when the context menu is to the left or right of the panel. Default is '50% 50%'.","example":"context-menu-arrow-position: 25% 50%;"},"context-menu-body-position":{"description":"Specifies where to position the body of a context menu relative to this panel. The first value controls how the body is aligned horizontally when the context menu is to the top or bottom of the panel, and the second value controls how the body is aligned vertically when the context menu is to the left or right of the panel. 0% means left/top aligned, 50% means center/middle aligned, and 100% means right/bottom aligned. Default is '0% 0%'.","example":"context-menu-body-position: 50% 100%;"},"context-menu-position":{"description":"Specifies where to position a context menu relative to this panel. Valid options include 'left', 'top', 'right', and 'bottom'. List up to 4 positions to determine the order that positions are tried if the context menu doesn't fully fit on screen. Default is 'right left bottom top'. If less than 4 positions are specified, the context menu first tries the opposite of the specified position along the same axis before switching to the other axis.","example":"context-menu-position: bottom;\r\ncontext-menu-position: left bottom;"},"contrast":{"description":"Sets the contrast that applies to the panel and all it's children during composition.","example":"contrast: 1.5;"},"flow-children":{"description":"&lt;Needs a description&gt;"},"font":{"description":"&lt;Needs a description&gt;"},"font-family":{"description":"Specifies the font face to use.","example":"font-family: Arial;\r\nfont-family: \"Comic Sans MS\";"},"font-size":{"description":"Specifies the target font face height in pixels.","example":"font-size: 12;"},"font-stretch":{"description":"Specifies the font stretch to use. Supported values are normal, condensed, and expanded.","example":"font-stretch: normal;\r\nfont-stretch: condensed;\r\nfont-stretch: expanded;"},"font-style":{"description":"Specifies the font style to use. Supported values are normal, and italic","example":"font-style: normal;"},"font-weight":{"description":"Specifies the font weight to use. Supported values are light, thin, normal, medium, bold, and black.","example":"font-weight: normal;\r\nfont-weight: bold;\r\nfont-weight: thin;"},"height":{"description":"Sets the height for this panel. Possible values:\r\n\"fit-children\" - Panel size is set to the required size of all children (default)\r\n&lt;pixels&gt; - Any fixed pixel value (ex: \"100px\")\r\n&lt;percentage&gt; - Percentage of parent height (ex: \"100%\")\r\n\"fill-parent-flow( &lt;weight&gt; )\" - Fills to remaining parent width. If multiple children are set to this value, weight is used to determine final height. For example, if three children are set to fill-parent-flow of 1.0 and the parent is 300px tall, each child will be 100px tall. (ex: \"fill-parent-flow( 1.0 )\" )\r\n\"width-percentage( &lt;percentage&gt; )\" - Percentage of the panel's width, which allows you to enforce a particular aspect ratio.  The width cannot also be height-percentage."},"horizontal-align":{"description":"&lt;Needs a description&gt;"},"hue-rotation":{"description":"Sets the hue rotation to apply to the panel and all it's children during composition. Default of 0.0 means no adjustment, domain is in degrees.","example":"hue-rotation: 180deg;"},"img-shadow":{"description":"Specifies image shadows.  The shadow shape will match the image the panel can generate,and this is only meaningful for images.  Syntax takes horizontal offset pixels, vertical offset pixels, blur radius pixels, strength, and then shadow color.","example":"img-shadow: 2px 2px 8px 3.0 #333333b0;"},"layout-position":{"description":"Sets how the panel is positioned relative to its parent. \"static\" means position in the default way. \"fixed\" means position in the default way, but ignoring the parent's scroll offset.","example":"layout-position: fixed;"},"letter-spacing":{"description":"Sets letter-spacing for text in a string. Possible values:\r\nnormal - no manual spacing\r\n&lt;pixels&gt; - Any fixed pixel value (ex: \"1px\")"},"line-height":{"description":"Specifies the line height (distance between top edge of line above and line below) to use for text. By default this is 'normal' and a value that matches the font-size reasonably will be used automatically. Unlike the web, we don't have a weird CSS inheritence problem with the 120% vs 1.2 styles.","example":"line-height: normal;line-height: 20px;line-height: 1.2;line-height: 120%;"},"margin":{"description":"&lt;Needs a description&gt;"},"margin-bottom":{"description":"&lt;Needs a description&gt;"},"margin-left":{"description":"&lt;Needs a description&gt;"},"margin-right":{"description":"&lt;Needs a description&gt;"},"margin-top":{"description":"&lt;Needs a description&gt;"},"max-height":{"description":"&lt;Needs a description&gt;"},"max-width":{"description":"&lt;Needs a description&gt;"},"min-height":{"description":"&lt;Needs a description&gt;"},"min-width":{"description":"&lt;Needs a description&gt;"},"opacity":{"description":"Sets the opacity or amount of transparency applied to the panel and all it's children during composition. Default of 1.0 means fully opaque, 0.0 means fully transparent.","example":"opacity: 0.8;"},"opacity-mask":{"description":"Applies an image as an opacity mask that stretches to the panel bounds and fades out it's content based on the alpha channel. The second float value is an optional opacity value for the mask itself, the image won't interpolate/cross-fade, but you can animate the opacity to fade the mask in/out. The -scroll-up, -scroll-down, and -scroll-up-down varients override the mask and apply only when the various vertical scroll scenarios affect the panel based on the overflow property.","example":"opacity-mask: url( \"file://{images}/upper_row_mask.tga\" );\r\nopacity-mask: url( \"file://{images}/upper_row_mask.tga\" ) 0.5;\r\nopacity-mask-scroll-up: url( \"file://{images}/upper_row_mask_up.tga\" ) 0.5;\r\nopacity-mask-scroll-down: url( \"file://{images}/upper_row_mask_down.tga\" ) 0.5;\r\nopacity-mask-scroll-up-down: url( \"file://{images}/upper_row_mask_up_down.tga\" ) 0.5;"},"opacity-mask-scroll-down":{"description":""},"opacity-mask-scroll-up":{"description":""},"opacity-mask-scroll-up-down":{"description":""},"overflow":{"description":"Specifies what to do with contents that overflow the available space for the panel. Possible values:\r\n\"squish\" - Children are squished to fit within the panel's bounds if needed (default)\r\n\"clip\" - Children maintain their desired size but their contents are clipped\r\n\"scroll\" - Children maintain their desired size and a scrollbar is added to this panel\r\n\"noclip\" - Children maintain their desired size and content is allowed to overflow this panel","example":"overflow: squish squish; // squishes contents in horizontal and vertical directions\r\noverflow: squish scroll; // scrolls contents in the Y direction"},"padding":{"description":"&lt;Needs a description&gt;"},"padding-bottom":{"description":"&lt;Needs a description&gt;"},"padding-left":{"description":"&lt;Needs a description&gt;"},"padding-right":{"description":"&lt;Needs a description&gt;"},"padding-top":{"description":"&lt;Needs a description&gt;"},"perspective":{"description":"Sets the perspective depth space available for children of the panel.  Default of 1000 would mean that children at 1000px zpos are right at the viewers eye, -1000px are just out of view distance faded to nothing.","example":"perspective: 1000;"},"perspective-origin":{"description":"Sets the perspective origin which will be used when transforming children of this panel.  This can be thought of as the camera x/y position relative to the panel.","example":"perspective-origin: 50% 50%;"},"position":{"description":"Sets the x, y, z position for a panel. Must not be in a flowing layout.","example":"position: 3% 20px 0px;"},"pre-transform-rotate2d":{"description":"Sets 2 dimensional rotation degrees that apply to the quad for this panel prior to 3 dimensional transforms. This rotation applies without perspective and leaves the panel centered at the same spot as it started.","example":"pre-transform-rotate2d: 45deg;"},"pre-transform-scale2d":{"description":"Sets 2 dimensional X/Y scale factors that apply to the quad for this panel prior to 3 dimensional transforms. This scaling applies without perspective and leaves the panel centered at the same spot as it started. Default of 1.0 means no scaling, 0.5 would be half size.","example":"pre-transform-scale2d: 0.8\r\npre-transform-scale2d: 0.4, 0.6"},"saturation":{"description":"Sets the amount of saturation to apply to the panel and all it's children during composition.  Default of 1.0 means no adjustment, 0.0 means fully desaturated to gray scale, greater than 1.0 means over-saturation.","example":"saturation: 0.4;"},"sound":{"description":"Specifies a sound name to play when this selector is applied.","example":"sound: \"whoosh_in\";"},"sound-out":{"description":"Specifies a sound name to play when this selector is removed.","example":"sound-out: \"whoosh_out\";"},"text-align":{"description":"Specifies the text alignment for text within this panel, defaults to left.","example":"text-align: left;\r\ntext-align: right;\r\ntext-align: center;\r\ntext-align: justify;\r\ntext-align: justify-letter-spacing;"},"text-decoration":{"description":"Specifies the decoration for text within this panel, defaults to none. Possible values: none, underline, line-through.","example":"text-decoration: underline;"},"text-decoration-style":{"description":"Specifies the decoration style for text within this panel, defaults to none. Possible values: none, dashed, dotted, wavy.","example":"text-decoration-style: dotted;"},"text-overflow":{"description":"Controls truncation of text that doesn't fit in a panel.  \"clip\" means to simply truncate (on char boundaries), \"ellipsis\" means to end with '...', and \"shrink\" means lower the font size to fit.  \"noclip\" allows the text to overflow based on the \"overflow\" style.\r\nWe default to ellipsis, which is contrary to the normal CSS spec.","example":"text-overflow: ellipsis;\r\ntext-overflow: clip;\r\ntext-overflow: shrink;\r\ntext-overflow: noclip;"},"text-shadow":{"description":"Specifies text shadows.  The shadow shape will match the text the panel can generate,and this is only meaningful for labels.  Syntax takes horizontal offset pixels, vertical offset pixels, blur radius pixels, strength, and then shadow color.","example":"text-shadow: 2px 2px 8px 3.0 #333333b0;"},"text-transform":{"description":"Specifies the transform for text within this panel, defaults to none. Possible values: none, uppercase, lowercase.","example":"text-transform: uppercase;"},"texture-sampling":{"description":"Controls texture sampling mode for the panel. Set to alpha-only to use the textures alpha data across all 3 color channels.","example":"texture-sampling: normal;\r\ntexture-sampling: alpha-only;"},"tooltip-arrow-position":{"description":"Specifies where to point the arrow of a tooltip at on this panel. The first value controls how the arrow is positioned horizontally when the tooltip is to the top or bottom of the panel, and the second value controls how the arrow is positioned vertically when the tooltip is to the left or right of the panel. Default is '50% 50%'.","example":"tooltip-arrow-position: 25% 50%;"},"tooltip-body-position":{"description":"Specifies where to position the body of a tooltip relative to this panel. The first value controls how the body is aligned horizontally when the tooltip is to the top or bottom of the panel, and the second value controls how the body is aligned vertically when the tooltip is to the left or right of the panel. 0% means left/top aligned, 50% means center/middle aligned, and 100% means right/bottom aligned. Default is '0% 0%'.","example":"tooltip-body-position: 50% 100%;"},"tooltip-position":{"description":"Specifies where to position a tooltip relative to this panel. Valid options include 'left', 'top', 'right', and 'bottom'. List up to 4 positions to determine the order that positions are tried if the tooltip doesn't fully fit on screen. Default is 'right left bottom top'. If less than 4 positions are specified, the tooltip first tries the opposite of the specified position along the same axis before switching to the other axis.","example":"tooltip-position: bottom;\r\ntooltip-position: left bottom;"},"transform":{"description":"Sets the transforms to apply to the panel in 2d or 3d space.  You can combine various transforms (comma separated) and they will be applied in order to create a 4x4 3d transform matrix.  The possible operations are: translate3d( x, y, z ), translatex( x ), translatey( y ), translatez( z ), scale3d( x, y, z), rotate3d( x, y, z ), rotatex( x ), rotatey( y ), rotatez( z ).","example":"transform: translate3d( -100px, -100px, 0px );\r\ntransform: rotateZ( -32deg ) rotateX( 30deg ) translate3d( 125px, 520px, 230px );"},"transform-origin":{"description":"Sets the transform origin about which transforms will be applied.  Default is 50% 50% on the panel so a rotation/scale is centered.","example":"transform-origin: 50% 50%"},"transition":{"description":"Specifies which properties should transition smoothly to new values if a class/pseudo class changes the styles.  Also specifies duration, timing function, and delay.  Valid timing functions are: ease, ease-in, ease-out, ease-in-out, linear.","example":"transition: position 2.0s ease-in-out 0.0s, perspective-origin 1.2s ease-in-out 0.8s;"},"transition-delay":{"description":"Specifies the delay in seconds to use for transition properties on this panel, if more than one comma delimited value is specified then the values are applied to each property specified in 'transition-property' in order.  If only one value is specified then it applies to all the properties specified in transition-property.","example":"transition-delay: 0.0s;\r\ntransition-delay: 0.0s, 1.2s;"},"transition-duration":{"description":"Specifies the durating in seconds to use for transition properties on this panel, if more than one comma delimited value is specified then the values are applied to each property specified in 'transition-property' in order.  If only one value is specified then it applies to all the properties specified in transition-property.","example":"transition-duration: 2.0s;\r\ntransition-duration: 2.0s, 1.2s, 1.2s, 4.0s, 2.0s;"},"transition-high-framerate":{"description":"Specifies the desire for higher framerate during this transition, if we have control.","example":"transition-high-framerate: true;\r\ntransition-high-framerate: false, true, false;"},"transition-property":{"description":"Specifies which properties should transition smoothly to new values if a class/pseudo class changes the styles.","example":"transition: position, transform, background-color;"},"transition-timing-function":{"description":"Specifies the timing function to use for transition properties on this panel, if more than one comma delimited value is specified then the values are applied to each property specified in 'transition-property' in order.  If only one value is specified then it applies to all the properties specified in transition-property. Valid timing functions are: ease, ease-in, ease-out, ease-in-out, linear.","example":"transition-timing-function: ease-in-out;\r\ntransition-timing-function: ease-in-out, linear;\r\ntransition-timing-function: cubic-bezier( 0.785, 0.385, 0.555, 1.505 );"},"ui-scale":{"description":"Specifies a scale to apply to this panel's layout and all descendants. This scale happens at the layout level ratherthan the bitmap level, so things like text will increase their font size rather than just bitmap scaling.","example":"ui-scale: 150%; // 150% scaling for X, Y, and Z.\r\nui-scale: 50% 100% 150%; // 50% scaling for X, 100% for Y. 150% for Z."},"ui-scale-x":{"description":"Specifies a scale to apply to this panel's layout and all descendants. This scale happens at the layout level ratherthan the bitmap level, so things like text will increase their font size rather than just bitmap scaling.","example":"ui-scale: 150%; // 150% scaling for X, Y, and Z.\r\nui-scale: 50% 100% 150%; // 50% scaling for X, 100% for Y. 150% for Z."},"ui-scale-y":{"description":"Specifies a scale to apply to this panel's layout and all descendants. This scale happens at the layout level ratherthan the bitmap level, so things like text will increase their font size rather than just bitmap scaling.","example":"ui-scale: 150%; // 150% scaling for X, Y, and Z.\r\nui-scale: 50% 100% 150%; // 50% scaling for X, 100% for Y. 150% for Z."},"ui-scale-z":{"description":"Specifies a scale to apply to this panel's layout and all descendants. This scale happens at the layout level ratherthan the bitmap level, so things like text will increase their font size rather than just bitmap scaling.","example":"ui-scale: 150%; // 150% scaling for X, Y, and Z.\r\nui-scale: 50% 100% 150%; // 50% scaling for X, 100% for Y. 150% for Z."},"vertical-align":{"description":"&lt;Needs a description&gt;"},"visibility":{"description":"Controls if the panel is visible and is included in panel layout. Possible values:\r\n\"visible\" - panel is visible and included in layout (default)\r\n\"collapse\" - panel is invisible and not included in layout"},"wash-color":{"description":"Specifies a 'wash' color, which means a color that will be blended over the panel and all it's children at composition time, tinting them.  The alpha value of the color determines the intensity of the tinting.","example":"wash-color: #39b0d325;"},"white-space":{"description":"Controls white-space wrapping on rendered text.  \"normal\" means wrap on whitespace, \"nowrap\" means do no wrapping at all.","example":"white-space: normal;\r\nwhite-space: nowrap;"},"width":{"description":"Sets the width for this panel. Possible values:\r\n\"fit-children\" - Panel size is set to the required size of all children (default)\r\n&lt;pixels&gt; - Any fixed pixel value (ex: \"100px\")\r\n&lt;percentage&gt; - Percentage of parent width (ex: \"100%\")\r\n\"fill-parent-flow( &lt;weight&gt; )\" - Fills to remaining parent width. If multiple children are set to this value, weight is used to determine final width. For example, if three children are set to fill-parent-flow of 1.0 and the parent is 300px wide, each child will be 100px wide. (ex: \"fill-parent-flow( 1.0 )\" )\r\n\"height-percentage( &lt;percentage&gt; )\" - Percentage of the panel's height, which allows you to enforce a particular aspect ratio.  The height cannot also be width-percentage."},"x":{"description":"Sets the x, y, z position for a panel. Must not be in a flowing layout.","example":"position: 3% 20px 0px;"},"y":{"description":"Sets the x, y, z position for a panel. Must not be in a flowing layout.","example":"position: 3% 20px 0px;"},"z":{"description":"Sets the x, y, z position for a panel. Must not be in a flowing layout.","example":"position: 3% 20px 0px;"},"z-index":{"description":"Sets the z-index for a panel, panels will be sorted and painted in order within a parent panel.  The sorting first sorts by the z-pos computed from position and transforms, then if panels have matching zpos zindex is used. z-index is different than z-pos in that it doesn't affect rendering perspective, just paint/hit-test ordering. The default z-index value is 0, and any floating point value is accepted.","example":"z-index: 1;"}}